#+title: OpenMS Protein Quantification node analysis
#+author:
#+date:  2020-10-26
#+PROPERTY: header-args :tangle openms_protein_quantification.R :session R :results silent

* Analysis
This script is for analysing the OpenMS protein quantification node output

#+begin_src R
## load packages
library(tidyverse)
library(STRINGdb)
library(org.Hs.eg.db)
library(ReactomePA)
library(gtools)
library(ggrepel)
library(gage)
library(gageData)
library(pathview)
library(RColorBrewer)
## load data
# need to read in headers and data separately to avoid metadata in first three rows
read_in_data <- function(file) {
headers <- read.csv(file, sep = "\t", skip = 3, header = F, nrows = 1)
prot_quant <- read.csv(file, sep = "\t", skip = 4, header = F)
colnames(prot_quant) <- headers
return(prot_quant)
}

prot_quant <- read_in_data("../../../../proteomic_data/knime_outputs/all_fraction_both_runs_itraq_workflow_2020-10-23/both_runs_protein_quantification.csv")
prot_quant_run1 <- read_in_data("../../../../proteomic_data/knime_outputs/fractions_merged_itraq_workflow/run1_protein_quantification.csv")
prot_quant_both_merged <- read_in_data("../../../../proteomic_data/knime_outputs/fractions_merged_itraq_workflow/protein_quantification_both_runs_2020-10-27.csv")
#+end_src

#+begin_src R
head(prot_quant)
str(prot_quant)
#+end_src

#+RESULTS:

Get more explanatory column names
#+begin_src R
update_col_names <- function(df, file, number) {
                                        # get files names
file_names <- read.csv(file, sep = "\t")
a <- file_names$Spectra_Filepath[1:number]
b <- file_names$Sample[(number + 3):length(file_names$Sample)]
c <- paste(a, b, sep = "_")

names(df)[5:length(names(df))] <- paste(names(df)[5:length(names(df))], c, sep = "_")
  return(df)
  }

prot_quant_run1 <- update_col_names(prot_quant_run1, "../../../../proteomic_data/experimental_design/fractions_merged_run1_experimental_design.tsv", 48)
prot_quant <- update_col_names(prot_quant, "../../../../proteomic_data/experimental_design/fractions_bothruns_experimental_design.tsv", 96)
prot_quant_both_merged <- update_col_names(prot_quant_both_merged, "../../../../proteomic_data/experimental_design/knime_ExperimentalDesign_fractions_merged_both_runs.tsv", 8)
#+end_src

There seems to be more than one accession in the column for some proteins, not sure why
#+begin_src R
get_protein_accession <- function(df) {
                                        # Get protein accession
# there are multiple accessions in the column
  library(qdapRegex)
  protein_accession_list <- rm_between(df$protein, "|", "|", extract = TRUE)
  df$protein_accession <-sapply(protein_accession_list, "[[", 1)
 head(df$protein_accession)
  return(df)
  }

prot_quant_run1 <- get_protein_accession(prot_quant_run1)
prot_quant <- get_protein_accession(prot_quant)
prot_quant_both_merged <- get_protein_accession(prot_quant_both_merged)
#+end_src

These functions get the name and description of the proteins from uniprot based
on the accession.
#+begin_src R
# functions to get uniprot descriptions from accessions
find_protein_description <- function(protein_id = ""){
        require(rvest)  # hadley wickham's package that can harvest html files
        website <- paste("https://www.uniprot.org/uniprot/", protein_id, sep = "") # website
        webpage <- read_html(website) # webpage read
        results <- webpage %>% html_nodes("meta") # get relevant data
        result <- as.character(results[[4]]) # 4th node is what you want
        result <- str_remove(result, "<meta content=\"") # strip beginning
        result <- str_remove(result, "\" name=\"description\">\n") # strip end
        return(result) # return result
}

find_protein_name <- function(protein_id = ""){
        require(rvest)  # hadley wickham's package that can harvest html files
        website <- paste("https://www.uniprot.org/uniprot/", protein_id, sep = "") # website
        webpage <- read_html(website) # webpage read
        name <- webpage %>% html_nodes("head")  %>% html_node("title") # get protein name
        name <- as.character(name[[1]])
        name <- str_remove(name, "<title>") # strip beginning
        name <- str_remove(name, "gene &amp; protein</title>\n") # strip end
        return(name) # return name
}
#+end_src

#+RESULTS:

#+begin_src R
                                        # Use functions
prot_quant$protein_name <- unlist(map(prot_quant$protein_accession, ~ find_protein_name(.x)))
prot_quant$protein_description <- unlist(map(prot_quant$protein_accession, ~ find_protein_description(.x)))
head(prot_quant)
prot_quant_run1$protein_name <- unlist(map(prot_quant_run1$protein_accession, ~ find_protein_name(.x)))
prot_quant_run1$protein_description <- unlist(map(prot_quant_run1$protein_accession, ~ find_protein_description(.x)))

prot_quant_both_merged$protein_name <- unlist(map(prot_quant_both_merged$protein_accession, ~ find_protein_name(.x)))
prot_quant_both_merged$protein_description <- unlist(map(prot_quant_both_merged$protein_accession, ~ find_protein_description(.x)))
#+end_src

#+RESULTS:
| prot_quant_both_merged |
| prot_quant_both_merged |

#+begin_src R
                                        # save data
write_rds(prot_quant, file = "../data/prot_quant_2020-10-26.rds")
write_rds(prot_quant_run1, file = "../data/prot_quant_run1_2020-10-26.rds")
write_rds(prot_quant_both_merged, file = "../data/prot_quant_both_merged_2020-10-29.rds")
#+end_src

#+begin_src R
## read in data as uniprot function take a while to run
prot_quant_both_merged <- read_rds("../data/prot_quant_both_merged_2020-10-29.rds")

prot_quant_long<- pivot_longer(prot_quant_both_merged, cols = contains("abundance"),
             names_to = "group", values_to = "abundance")
#+end_src

